// Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

//[3, 7, 23, 12] -> 19

//[-4, -6, 89, 6] -> 0

// 1 действеи : нам нужен массив, заполненный случайными числами

//Копируем МЕТОД, который будет создавать массив
int[] array = GetArray(4,-100, 100); //Массив GetArray возвращает вам массив на 10 элементов , заполненный числами от -100 до 100
                                  // и сохраняет всё это в массивчик array.Таким образом в массиве array находится 10 чисел от 
                                  //-100 до 100
                //Чтобы проверить это выведем на консоль способом String.Join: Склеиваем 12 элементов подстрочек с помощю Join
Console.WriteLine($"[ {String.Join(";", array)}]");
int[] GetArray(int size, int minValue, int maxValue)
{
    int[] rezult = new int[size]; // Создание массива на size элементов, верхние две сторчки закомменчены
    // Если size = 10, то массив состоит из 10 нулей
    //for (int i = 0; i < rezult.length; i++)  //rezult.length = size  заменяем :
    for (int i = 0; i < rezult.Length; i++)
    {
        rezult[i] = new Random().Next(minValue, maxValue+1); // обращаемся к каждому элементу массива по его индексу
        // и вписываем во все индексы рандомные числа от minValue до почти maxValue. Чтобы включить последнее число 
        // нужно прибавить единичку.
    }
    // Массив готов. Нужно его вернуть.
    return rezult; //вернули массив на size элементов, заполненный числами от minValue до  maxValue

} 
// у нас есть массив array , будем работать с ним.
// 2 действие : ищем сумму чисел начиная со второй позиции массива, так как она является нечётной
// и будем скакать с интервалом 2
// обозначим сумму как sum  и положим туда 0. 
int sum = 0;
// начнем перебор
for (int i = 1; i < array.Length; i=i+2) // значит начнём с единички, на всю длинну массива array, прыгая через 2
{
    sum = sum + array[i]; // в изначально пустую сумму начнём складывать результаты массива начиная с № 1  
    // и прибавляя предыдущий результат
}

// Выводим на консоль результат. Результатом будет сумма

Console.WriteLine($" Сумма на нечетных позициях  = {sum} ");

// Вау! С первого раза! 